using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using UnityEngine;

//Ход комманды {
//  Ход игроков --(закончить ход)--> Конец хода
//  Конец хода - это ход на котором ходят боты, затем происходит атака
//  Конец хода --()--> Переход к другой комманде(бездействие)
//  Переход к другой комманде --()-->Ход игроков(других)
// }
// Комманда 1 -> Комманда 2 -> Комманда 3 -> Комманда 1 ->....

//Ход персонажем {
//  Не выбран --(когда выбрали)-->Выбран
//  Выбран --(мы походили)--> Выполнил действие
//  Выбран --(Выбрали другого)--> Не выбран
//  Выполнил действие --()--> Походил
//  Не выбран --(в конце хода)--> Походил
//}

public class Team
{
    //По идее, состоит из игроков. Возможно просто из героев. Имеет собственный номер и состояние.
}
/// <summary>
/// Ответветственнен за очерёдность хода комманд
/// </summary>
public class TurnCycle : MonoBehaviour
{
    List<Team> teams;
    Turn turnState;
    public void SetState(Turn turn)
    {
        turnState = turn;
        StartCoroutine(turn.Start());
    }
    private void Start()
    {
        //turnState = new 
    }

}